[{"author":"Syed Muhammad Saleem","date":"Dec 27, 2018","stars":"5","text":"Really great \nEasy to use \nUser friendly \nLarger time screen captures \nClear video and sound \nSimply, I love it \nGood job"},{"author":"Jaquaiden Mitchell Jack","date":"May 17, 2019","stars":"5","text":"thank you very much"},{"author":"nathan haggie","date":"Dec 28, 2018","stars":"4","text":"Love the extension.  Just need a few more options like how to change from one screen to another."},{"author":"abhi ydas","date":"Dec 22, 2018","stars":"5","text":"It is really nice :) pls add edit and trim option as well"},{"author":"Shaney Dacosta","date":"Apr 12, 2021","stars":"5","text":"it was working perfectly for me the stop opening after about a month of using it. I deleted and re downloaded it but it only got worse. It's upsetting"},{"author":"Asher Bean","date":"Jan 3, 2019","stars":"5","text":"You have to pay for editing\n"},{"author":"Nathan Norris","date":"Dec 26, 2018","stars":"1","text":"I hate how the maximum length without premium is only 10 minutes. That is absolute trash. Hate it, and you're getting 1 star. Looking for another screen recorder now."},{"author":"Colleague Riley","date":"Dec 31, 2018","stars":"1","text":"10 minuets is the average length of a youtube video and it works better then some screen recorders you have to pay for. "},{"author":"Sienna Valdez","date":"Dec 22, 2018","stars":"5","text":"THIS IS THE BEST THING EVER! This is so easy! Recommended"},{"author":"Nathan Donald","date":"May 16, 2019","stars":"5","text":"Don't listen to them. Its a great website."},{"author":"A Google User","date":"Jan 26, 2019","stars":"5","text":"this is soooooo bad i cannot believe you liked it. It might be easy but it is horrible quality.Soapbox is easy,good quality and freee"},{"author":"Layla Delah","date":"Jan 1, 2019","stars":"5","text":"its ok i mean it lags but still loved it so make sure you get this app :)))"},{"author":"Simon Belfer","date":"Dec 28, 2018","stars":"5","text":"great exention easy to use fun. it is realy helping my youtube channel ."},{"author":"Cuthcuthcuth","date":"Dec 24, 2018","stars":"5","text":"Love It"},{"author":"Simlish Interpreter","date":"Dec 29, 2018","stars":"4","text":"I would of given it a full star but, 10 minutes is to short. Please make it longer! Thanks!"},{"author":"Jaquaiden Mitchell Jack","date":"May 17, 2019","stars":"4","text":"sure"},{"author":"Gordon Van Wyk","date":"Dec 27, 2018","stars":"2","text":"Lost all PC audio after allowing permissions on install on new PC w/Windows 10. Does not allow to set default local save folder, Does not even tell you where on your local drive where the default save folder is. Uninstalling hoping to get PC audio back. Has potential enough to warrant 2 stars."},{"author":"Deeta Kimber","date":"Dec 18, 2018","stars":"1","text":"Buggy, waste a lot of time getting the trimmer and editor to work, glitches in the sound quality."},{"author":"A Google User","date":"Jan 7, 2019","stars":"1","text":"Leaveyour enties in the subreddit bros and ill watch submisions in the next episode of lwiay"},{"author":"A Google User","date":"Dec 18, 2018","stars":"1","text":"Hi there, \n\nI'm so sorry to hear that you have experienced bugs while using Screencastify. We' love to help with editing and the sound quality. Will you send us an email at support@screencastify.com? It may also be helpful to check out our help articles at help.screencastify.com\n\nNef @ Screencastify"},{"author":"MasterAce Kickers","date":"Dec 19, 2018","stars":"4","text":"i had to find a screen recorder because today was the start of my new youtube channel and i like to do things when i say i will do them, i went onto google and searched easy screen recorder and im glad i chose this one"},{"author":"nota user","date":"Jan 19, 2019","stars":"4","text":"i started a new youtube channel too! whats your youtube channel name?I hope this was helpful but it wasn't such a good recorder. or maybe my computers broken or something."},{"author":"David Young","date":"Dec 18, 2018","stars":"5","text":"Puts the fun back into setting down to the computer, and has greatly enhanced \"deliverables\" for customer facing promotional  materials."},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thank you for the kind words! \n\nNef @ Screencastify"},{"author":"hi hi","date":"Dec 15, 2018","stars":"5","text":"love it 10 stares if you see me or fjffjkykfjjhf *"},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thank you for the kind words. \n\nNef @ Screencastify"},{"author":"Rich S","date":"Dec 17, 2018","stars":"4","text":"great program."},{"author":"Gopal Kumar","date":"Jan 14, 2019","stars":"4","text":"best app\n"},{"author":"A Google User","date":"Dec 18, 2018","stars":"4","text":"Thank you! We pride ourselves on putting out an excellent product. \n\nNef @ Screencastify"},{"author":"ahamba solomon","date":"Dec 12, 2018","stars":"5","text":"this is an awesome tool"},{"author":"A Google User","date":"Jan 11, 2019","stars":"5","text":"definatly"},{"author":"A Google User","date":"Jan 4, 2019","stars":"5","text":"Should i download it?"},{"author":"A Google User","date":"Dec 21, 2018","stars":"5","text":"I agree! Easy to use, and helps with a lot of different things."},{"author":"thomas alboth","date":"Dec 10, 2018","stars":"1","text":"Installed the Plugin. But I can't start the Screencast without adding a GoogleAccount. \nMaybe I do not grant any app access to my GoogleDrive, cause there is important stuff and it is too risky for me (yes, I am German - ;)\n\nSo nope -- I won't use this app."},{"author":"A Google User","date":"Dec 21, 2018","stars":"1","text":"I think it´s fine."},{"author":"A Google User","date":"Dec 18, 2018","stars":"1","text":"Hi Thomas, \n\nThe extension is built to work best with Google and specifically Google Drive. You'll need to log on with your Google account. However, you can turn Google Drive sharing off so that videos are only saved to your computer. If you would like more information, please reach out to us at support@screencastify.com\n\nThanks for giving us a try, \nNef @ Screencastify"},{"author":"Frito Og","date":"Dec 16, 2018","stars":"1","text":"ok"},{"author":"Maulik Shah","date":"Dec 10, 2018","stars":"5","text":"Awesome tool  - Must use .. Feels like giving webinar when using Embed camera option"},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thanks for the feedback! We want to make it extremely easy for anyone to create webinars. \n\nNef @ Screencastify"},{"author":"Frito Og","date":"Dec 16, 2018","stars":"5","text":"cool right"},{"author":"Shane O'Dazier","date":"Dec 10, 2018","stars":"5","text":"super easy way to record things!  able to record everything I do so my team can watch later..."},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thank you for the kind words. Glad that you have a new way to connect with your team. \n\nNef @ Screencastify"},{"author":"Frito Og","date":"Dec 16, 2018","stars":"5","text":"ok"},{"author":"Caleb-a-dog","date":"Dec 7, 2018","stars":"5","text":"you guys that have this app should love it because it's the best in my opinion.  i post my youtube videos with it at school. Check out my youtube if you can. Caleb The gamer"},{"author":"A Google User","date":"Dec 16, 2018","stars":"5","text":"I also use it to record youtube videos make sure to check out  my youtube videos/ George haritakis"},{"author":"Honk","date":"Dec 9, 2018","stars":"3","text":"It's pretty good... UGH! MONEEEEEY!"},{"author":"A Google User","date":"Dec 18, 2018","stars":"3","text":"Hi there, \n\nGlad to hear that you like it. You should be happy to know that the lite version of our extension is free and we are committed to keeping it free forever. \n\nNef @ Screencastify"},{"author":"Frito Og","date":"Dec 16, 2018","stars":"3","text":"good"},{"author":"Internet Free","date":"Dec 10, 2018","stars":"5","text":"good extension.... would like to have more free something like this :)) :D"},{"author":"ZIZO Zanaty","date":"Dec 8, 2018","stars":"5","text":"nice"},{"author":"Jeremy S","date":"Nov 24, 2018","stars":"5","text":"Have been using it for several years on multiple systems without issue.  Curious why some people are having issues running it and experiencing lag.  Perhaps it takes a system that has enough horsepower to use it.  I also introduced this program at work to make videos showing how to reproduce GUI bugs.  Have never heard of anyone having issues using it.  \n\nLove that videos are uploaded to google accounts.  Since work uses google as our mail system we can limit our video views to email addresses on our domain only.  Very helpful."},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"I'm so glad to hear that you have used the extension across multiple devices and years. Thank you for the kind words and feedback. \n\nNef @ Screencastify"},{"author":"A Google User","date":"Dec 4, 2018","stars":"5","text":"Some people have trouble with the audio, and having the voice heard without sounding like there was static electricity"},{"author":"A Google User","date":"Nov 27, 2018","stars":"5","text":"I like this app  \n*****\n5 Stars!"},{"author":"AdMan The Lab Rat","date":"Dec 6, 2018","stars":"4","text":"WE LOVE IT, so much even got the upgrade and have been intuitively using it for well over a year now.\nThen school decides to buy three years of M$N 365 and our Master Professors 'prefer' we use Scream'O-Matic then we have to ditch both of those because neither plays nicely with the Non-Chrome Compliant \"Lock-Down Browser\" (Honesty & Integrity Maintainer -Nah, more like false sense of Security and a waste of educational funds, time and other scarce much needed resources. I'll be back after this class!"},{"author":"AdMan The Lab Rat","date":"Jan 24, 2019","stars":"4","text":"Nef'ster,  \n\"Doh-Ray-Me-Sew/So Happy To Be Back!!!!\" \nEspecially enjoying the high-speed, low-drag, latest & upgradest, PREMIUM SCREENCASTIFY!\nStay Motivated!\nATLR"},{"author":"A Google User","date":"Dec 18, 2018","stars":"4","text":"So happy to hear that you enjoy the extension. I hate that you'll have to take a hiatus but we hope that you'll be back \n\nNef @ Screencastify"},{"author":"JB CASES","date":"Nov 29, 2018","stars":"5","text":"This extension has been invaluable.  Simple to use and just works.  I used the free version for a long time and donated/paid to support them for building such an awesome product.  So easy to communicate to my team and customers with short videos rather than the tedious process of lots of back and forth texting/talking."},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thank you for the kind words! We appreciate you electing to go premium. \n\nNef @ Screencastify"},{"author":"Murat Assanov","date":"Nov 23, 2018","stars":"5","text":"I have my business out of country where I actually live. Sometimes I waste too much time to explain to my employee what and how to do. It takes too much time for me and for my employee. That was a reason why I started looking something to improve my efficiency in it. I didn't spend too much to get known how it works. It's very simple program to use and it works very effectively for me. I like this program and hope it will never be stopped."},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Wow! It's amazing to hear that the extension has helped you to connect with your employees from a long distance. Thanks for the kind words. \n\nNef @ Screencastify"},{"author":"Beauty On A Budget","date":"Nov 21, 2018","stars":"5","text":"Love using it to film my gaming sucks the limit is 10 mins tho but when i can afford it I'll upgrade"},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Hi there, \n\nThanks for using the extension to record your awesome gaming. We're excited to see what you can do once you go premium. \n\nNef @ Screencastify"},{"author":"Simulated_1","date":"Nov 24, 2018","stars":"5","text":"Your app for Chrome OS is amazing! Never tried anything like it, keep up the good work! 5 Stars!"},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thank you for the kind words. \n\nNef @ Screencastify"},{"author":"Leon Harris","date":"Nov 22, 2018","stars":"5","text":"This is my favourite and most used extension, and I soon upgraded to paid so I could download MP4s. I used it to generate explainer videos for all my apps and demo web designs. Also the customer support is great :)"},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thank you for the kind words. It's our goal to provide excellent customer support. We are always here when needed. \n\nNef @ Screencastify"},{"author":"hello","date":"Nov 21, 2018","stars":"2","text":"It was very laggy while recording and it would only record for 10 min without paying"},{"author":"A Google User","date":"Dec 21, 2018","stars":"2","text":"ya ik\n"},{"author":"A Google User","date":"Dec 18, 2018","stars":"2","text":"Hi there, \n\nI'm sorry to hear that you're having problems. Will you send us an email at support@screencastify.com? You might also find the information on our help page - help.screencastify.com - helpful. \n\nWe want to make this right for you,\nNef @ Screencastify"},{"author":"A Google User","date":"Dec 17, 2018","stars":"2","text":"i love it too\n"},{"author":"Liz Schneidewin","date":"Nov 26, 2018","stars":"5","text":"I just used screencastify for the first time this morning. It took five minutes to figure out the basics thanks to the excellent instruction library. It works. It really works! Plus, once I realised I needed to upgrade I was thrilled to see such reasonable prices for occasional users such as myself."},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Amazing! We pride ourselves on building a product that is tremendously easy to use. \n\nNef @ Screencastify"},{"author":"A Google User","date":"Nov 30, 2018","stars":"5","text":"how do I start a recording??"},{"author":"Motty Wolodarsky","date":"Nov 18, 2018","stars":"5","text":"Loving it best thing since sliced bread"},{"author":"A Google User","date":"Dec 18, 2018","stars":"5","text":"Thanks for the kind words. \n\nNef @ Screencastify"},{"author":"Gregory Campbell","date":"Dec 5, 2018","stars":"5","text":"Best available. Great for video audits."},{"author":"Gaming With Dondoom","date":"Nov 23, 2018","stars":"1","text":"ITS THE WORST RECORDER POSSIBLE"},{"author":"A Google User","date":"Dec 18, 2018","stars":"1","text":"Hi there, \n\nIt is always our aim to make sure the product works for everyone. It sounds like you have had a bad experience which we apologize for. Will you send us an email at support@screencastify.com? We'd love to get to the bottom of what's going on. \n\nNef @ Screencastify"},{"author":"A Google User","date":"Nov 26, 2018","stars":"1","text":"yes it is"},{"author":"Angela Ramirez de Gomez","date":"Nov 18, 2018","stars":"5","text":"Well, this app is VERY GOOD!!!!!!!!!!!!!!!!!!!!!!"},{"author":"Umair Ali","date":"Nov 22, 2018","stars":"5","text":"Awesome"},{"author":"A Google User","date":"Nov 28, 2018","stars":"5","text":"i agree "},{"author":"Mars","date":"Nov 29, 2018","stars":"3","text":"I wish you could crop it without having to use premium for $24 a year."},{"author":"Eli Falkenberg","date":"Sep 19, 2019","stars":"3","text":"right"},{"author":"Allie Jeffs","date":"Nov 20, 2018","stars":"5","text":"It is so awesome! I can make videos on here and upload it to YouTube if I want!!!!!!!!!!!!!!!!!!!!! AWESOME JOB!!!!!!!!!!!!!!!!"},{"author":"MK District","date":"Nov 23, 2018","stars":"2","text":"When i Record it Slows down my computer where it looks like its laggy so i dont hardly wanna record"},{"author":"A Google User","date":"Dec 13, 2018","stars":"2","text":"maybey its what your laying?"},{"author":"DoodleDotDot","date":"Nov 16, 2018","stars":"3","text":"It's laggy but if your recording short videos it's okay to use and also it has editing so that's a plus"},{"author":"A Google User","date":"Nov 19, 2018","stars":"3","text":"laggy? "},{"author":"Fabian Mccray","date":"Nov 12, 2018","stars":"3","text":"Bad: Why does it have to pay FOR EVERY THING EDITING, RECORDING, At least add a limited amout of this stuff! Its LAGGY as well\n\nGood: It uses your camera while recording! It does record good and gives you acces to tools. I guess you can still edit it on YT too."},{"author":"A Google User","date":"Dec 5, 2018","stars":"3","text":"Im quite sure thats why things like OBS exist, and if you were expecting a good recorder and editor, get off of chrome web store."},{"author":"A Google User","date":"Nov 20, 2018","stars":"3","text":"good jod"},{"author":"Minoumimi","date":"Nov 16, 2018","stars":"3","text":"well you can simply download the file has if it was in a folder and edit it in our own software.. O_o\nbut ya.. the branding is... not something i can allow\ntry out webrtc"},{"author":"David M","date":"Nov 14, 2018","stars":"4","text":"well, simply if your trying to record a movie, or record your self gaming. this sucks, it will lag out out of everything.\ni do like that you can have your webcam and the tab open at the same time, you you can talk while showing it on the screen.\nalso it gives you 50 free vids per month or somthing. honestly i never exceede 2. some people may use this more than me though. if you dont buy premium it will gove you some basic tools, but this is not a super high class extention that I use much. still. it dont take up storage so im just keeping it.\nid sujest it to any one that needs to make some simple vids for school or somthing like that, not for anything pro.\nalso i think they should make it where you can also stream stuff live. but its laggy enough allready."},{"author":"Jack Rogers","date":"Nov 3, 2018","stars":"1","text":"This is horrible they make you have to buy the editing for the video and they also don't have a way to get rid of there branding on your video even if you could buy it they should still have a way to get rid of it at least make it to were you can move it."},{"author":"A Google User","date":"Nov 8, 2018","stars":"1","text":"Hi Jack, \n\nOur premium subscriptions remove the watermark completely. The editor is available as a premium feature. However, there is a free trial available if you would like to give it a try before you buy. You can access the free trial here - https://editor.screencastify.com/free_trial\n\nNef @ Screencastify"},{"author":"Regine Canillas","date":"Nov 15, 2018","stars":"1","text":"Screencastify do not stand behind their product. My experience is that it's terrible software. I spent 4+ hours changing settings and trying to get the right mic configuration to no avail. It would only use the external mic to record video instead of the internal sound recording. I emailed support at least 15 times and eventually they made me feel like it was my problem or my fault and that this was probably the first example of such a failure they had ever ever ever experienced. And then when i said i could no longer justify spending more time trying all the different options to fix the problem the response was \"I cannot process your refund since we have a no-refund policy which is detailed in our terms. I'm afraid you'll get the same response from anyone else in the company. \". LESSON: anyone who reverts immediately to say that the refusal to do the right thing and respond to a genuine complaint is buried in \"the terms and conditions\" is a BIG red flag. Surely if you have a good product and good support but cannot solve the exceptional occasion when some technical thing causes a failure to use the product then you would be more than happy to refund that customers purchase. But in this case the immediate response was a denial. All that says is that the problem probably isnt unique and that they certainly do not stand behind their product."},{"author":"Lady Space","date":"Nov 24, 2018","stars":"1","text":"I'm brand new to this stuff so pardon my ignorance but I'm looking for info regarding the mic situation. Do I need to buy a mic to record videos with sound (me speaking for example)? I tried a couple test videos and no sound was recorded. I think the only option it gave me was internal mic."},{"author":"Dennis G D","date":"Oct 17, 2019","stars":"5","text":"I use it everyday. Very good. A small wish, that there was an audio indicator in the preview window so I know that audio is being recorded... paid version produces gifs, mp4 and you can crop/edit for just pieces of the video. Nice."},{"author":"Brian Baker","date":"Nov 14, 2018","stars":"4","text":"Works really well. No software to bloat your computer or learn. Simple and straigt forward. Its worth it to get the Premium version."},{"author":"charlotte","date":"Nov 10, 2018","stars":"5","text":"It's so cool! I can finally record videos on YouTube!"},{"author":"Shen Feng Yong","date":"Nov 7, 2018","stars":"2","text":"Very bad voice recording, a lot of voice not cancelled"},{"author":"Liz Schneidewin","date":"Nov 26, 2018","stars":"2","text":"Hi, I had the same experience the first time I used the recorder but the instructional library showed me how to change the settings to make it work. Turn off the external microphone (unless you want to record your own overlay commentary) then select 'Show more options' on the recording dialogue box. This will give you the option to record Tab Audio. This is what worked for me. Good luck."},{"author":"A Google User","date":"Nov 8, 2018","stars":"2","text":"Hi there, \n\nWe're sorry to hear that your recording included a ton of additional noise. Generally, this can be reduced by recording in a quiet room and optimizing the microphone in Screencastify settings. If that doesn't work, will you contact us at support@screencastify.com?\n\nNef @ Screencastify"},{"author":"Pablo Cid","date":"Nov 12, 2018","stars":"5","text":"Hi, I think is a very useful tool, simple and fast enough."}]
